{ "translations": {
    "This user account is disabled, please contact your administrator." : "Esta cuenta de usuario se encuentra deshabilitada, por favor contacta a tu administrador.",
    "Saved" : "Guardado",
    "Unknown error, please check the log file for more details." : "Error desonocido, por favor revisa el archivo de bitácora para más detalles.",
    "Direct log in" : "Inicio de sesión directo",
    "SSO & SAML log in" : "Inicio de sesión SSO & SAML",
    "X.509 certificate of the Service Provider" : "certificado X.509 del Proveedor de Servicio",
    "Private key of the Service Provider" : "Llave privada del Proveedor de Servicio",
    "Indicates that the nameID of the <samlp:logoutRequest> sent by this SP will be encrypted." : "Indica que el nameID de <samlp:logoutRequest> enviado por este SP será encriptado. ",
    "Indicates whether the <samlp:AuthnRequest> messages sent by this SP will be signed. [Metadata of the SP will offer this info]" : "Indica si los mensajes <samlp:AuthnRequest> enviados por este SP serán firmados. [Los metadatos del SP proporcionarán esta información]",
    "Indicates whether the  <samlp:logoutRequest> messages sent by this SP will be signed." : "Indica si los mensjaes <samlp:logoutRequest> enviados por este SP serán firmados. ",
    "Indicates whether the  <samlp:logoutResponse> messages sent by this SP will be signed." : "Indica is los mensajes <samlp:logoutResponse> enviados por este SP serán firmados. ",
    "Whether the metadata should be signed." : "Si los metadatos deben ser firmados o no. ",
    "Indicates a requirement for the <samlp:Response>, <samlp:LogoutRequest> and <samlp:LogoutResponse> elements received by this SP to be signed." : "Indica un requerimiento para que los elementos recibidos <samlp:Response>, <samlp:LogoutRequest> y <samlp:LogoutResponse> por este SP sean firmados. ",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be signed. [Metadata of the SP will offer this info]" : "Indica un requerimiento para que los elementos recibidos <saml:Assertion> de este SP sean firmados. [Los metadatos del SP proporcionarán esta información]",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be encrypted." : "Indica un requerimiento para que los elelemtnos recibidos <saml:Assertion> de este SP sean encriptados. ",
    " Indicates a requirement for the NameID element on the SAMLResponse received by this SP to be present." : "Indica un requerimiento para que el elemento NameID en la SAMLResponse recibida por este SP esté presente. ",
    "Indicates a requirement for the NameID received by this SP to be encrypted." : "Indica que un requerimiento para el NameID recibido por este SP está encriptado.",
    "Indicates if the SP will validate all received XML." : "Indica si el SP validará todos el XML recibido. ",
    "ADFS URL-Encodes SAML data as lowercase, and the toolkit by default uses uppercase. Enable for ADFS compatibility on signature verification." : "ADFS URL-Codifica los datos SAML como minúsculas, y el juego de herramientas usa mayúsculas por defecto. Habilita para tener compatibilidad con ADFS en la verificación de la firma.",
    "Attribute to map the UID to." : "Atributo a mapear al UID.",
    "Only allow authentication if an account exists on some other backend. (e.g. LDAP)" : "Sólo permitir la autenticación si la cuenta exite en algún otro backend. (p. ej. LDAP)",
    "Attribute to map the displayname to." : "Atributo a mapear a displayname. ",
    "Attribute to map the email address to." : "Atributo a mapear a email address.",
    "Attribute to map the quota to." : "Atributo al cual mapear la cuota. ",
    "Attribute to map the users groups to." : "Atributo de correspondiencia de grupos de usuarios.",
    "Use SAML auth for the %s desktop clients (requires user re-authentication)" : "Por favor usa autenticación SAML para los %s clientes de escritorio (se requiere volver a autenticar)",
    "Optional display name of the identity provider (default: \"SSO & SAML log in\")" : "Nombre a desplegar opcional de la identidad del proveedor (valor por omisión: \"Inicio de sesión SSO & SAML\")",
    "Allow the use of multiple user back-ends (e.g. LDAP)" : "Permitir el uso de múltiples sistemas de back-end de usuario (p. ej. LDAP)",
    "SSO & SAML authentication" : "Autenticación SSO & SAML",
    "Authenticate using single sign-on" : "Autenticar usando inicio de sesión único",
    "Using the SSO & SAML app of your Nextcloud you can make it easily possible to integrate your existing Single-Sign-On solution with Nextcloud. In addition, you can use the Nextcloud LDAP user provider to keep the convenience for users. (e.g. when sharing)\nThe following providers are supported and tested at the moment:\n\n* **SAML 2.0**\n\t* OneLogin\n\t* Shibboleth\n\t* Active Directory Federation Services (ADFS)\n\n* **Authentication via Environment Variable**\n\t* Kerberos (mod_auth_kerb)\n\t* Any other provider that authenticates using the environment variable\n\nWhile theoretically any other authentication provider implementing either one of those standards is compatible, we like to note that they are not part of any internal test matrix." : "Usando la aplicación de SSO & SAML de tu Nextcloud podrás hacer la integración de tu solución de Inicio de Sesión Única con Nextcloud de forma sencilla. Adicionalmente, podrás usar el proveedor de usuarios Nextcloud LDAP para la conveniencia de los usarios (p.e. al comparitr)\nLos siguientes porveedores están soportados y probados hasta este momento:\n\n* **SAML 2.0**\n* OneLogin\n* Shibboleth\n* Active Directory Federation Services (ADFS)\n\n* **Autentciación mediante Variable de Ambiente**\n* Kerberos (mod_auth_kerb)\n* Cualquier otro proveedor que autentica usando variable de ambiente\n\nMientras que teóricamente cualquier otro proveedor de autenticación que implemente cualquiera de esos estándares es compatible, nos gustaria hacer notar que no son parte de alguna matriz de pruebas interna. ",
    "Open documentation" : "Abrir documentación",
    "Please choose whether you want to authenticate using the SAML provider built-in in Nextcloud or whether you want to authenticate against an environment variable." : "Por favor selecciona si deseas autenticarte usando el proveedor integrado SAML de Nextcloud o si deseas autenticarte contra una variable de ambiente.  ",
    "Use built-in SAML authentication" : "Usar autenticación SAML integrada",
    "Use environment variable" : "Usar la variable de ambiente",
    "General" : "General",
    "Service Provider Data" : "Datos del Proveedor de Servicio",
    "If your Service Provider should use certificates you can optionally specify them here." : "Si tu Proveedor de Servicio debe usar certificados, puedes especificarlos opcionalmente desde aquí.",
    "Show Service Provider settings…" : "Mostrar las configuraciones de Proveedor de Servicio...",
    "Identity Provider Data" : "Datos del Proveedor de Identidad",
    "Configure your IdP settings here." : "Configura las configuraciones de IdP aquí. ",
    "Identifier of the IdP entity (must be a URI)" : "Identificador de la entidad IdP (debe ser un URI)",
    "URL Target of the IdP where the SP will send the Authentication Request Message" : "URL Destino del IdP donde el SP enviará automaticamente el Mensaje de Solicitud de Autenticación",
    "Show optional Identity Provider settings…" : "Mostrar las configuraciones opcionales del Proveedor de Identidad...",
    "URL Location of the IdP where the SP will send the SLO Request" : "Ubicación del URL del IdP donde el SP enviará la Solicitud SLO",
    "Public X.509 certificate of the IdP" : "Certificado X.509 público del IdP",
    "Attribute mapping" : "Mapeo del atributo",
    "If you want to optionally map attributes to the user you can configure these here." : "SI opcionalmente quieres mapear los atributos del usuario, puedes configurarlos aquí.",
    "Show attribute mapping settings…" : "Mostrar las configuraciones del mapeo de atributos...",
    "Security settings" : "Configuraciones de seguridad",
    "For increased security we recommend enabling the following settings if supported by your environment." : "Para mayor seguridad te recomendamos habilitar las siguientes configuraciones si están soportados en tu ambiente.",
    "Show security settings…" : "Mostrar las configuraciones de seguridad...",
    "Signatures and encryption offered" : "Firmas y encripción disponibles",
    "Signatures and encryption required" : "Firmas y encripción requeridos",
    "Download metadata XML" : "Descargar metadatos XML",
    "Metadata invalid" : "Metadatos inválidos",
    "Metadata valid" : "Metadatos válidos",
    "Error" : "Error",
    "Account not provisioned." : "La cuenta no está aprovisionada. ",
    "Your account is not provisioned, access to this service is thus not possible." : "Tu cuenta no ha sido aprovisionada, por lo cual el acceso a este servico no es posible. "
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}