{ "translations": {
    "Saved" : "Gardado",
    "X.509 certificate of the Service Provider" : "Certificado X.509 do provedor do servizo",
    "Private key of the Service Provider" : "Chave privada do provedor do servizo",
    "Indicates that the nameID of the <samlp:logoutRequest> sent by this SP will be encrypted." : "Indica que o nameID do <samlp:logoutRequest> enviado por este SP vai ser cifrado.",
    "Indicates whether the <samlp:AuthnRequest> messages sent by this SP will be signed. [Metadata of the SP will offer this info]" : "Indica se as mensaxes <samlp:AuthnRequest> enviados por este SP van seren asinados. [Os metadatos do SP ofrecerán esta información]",
    "Indicates whether the  <samlp:logoutRequest> messages sent by this SP will be signed." : "Indica se as mensaxes <samlp:logoutRequest> enviados por este SP van seren asinados.",
    "Indicates whether the  <samlp:logoutResponse> messages sent by this SP will be signed." : "Indica se as mensaxes <samlp:logoutResponse> enviados por este SP van seren asinados.",
    "Whether the metadata should be signed." : "Se os metadatos deben ser asinados.",
    "Indicates a requirement for the <samlp:Response>, <samlp:LogoutRequest> and <samlp:LogoutResponse> elements received by this SP to be signed." : "Indica un requisito para os elementos <samlp:Response>, <samlp:LogoutRequest> e <samlp:LogoutResponse> recibidos por este SP para seren asinados.",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be signed. [Metadata of the SP will offer this info]" : "Indica un requisito para os elementos <saml:Assertion> recibidos por este SP para seren asinados. [Os metadatos do SP ofrecerán esta información]",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be encrypted." : "Indica un requisito para os elementos <saml:Assertion> recibidos por este SP para seren cifrados.",
    " Indicates a requirement for the NameID element on the SAMLResponse received by this SP to be present." : "Indica un requisito para que o elemento NameID no SAMLResponse recibido por este SP estea presente.",
    "Indicates a requirement for the NameID received by this SP to be encrypted." : "Indica un requisito para que o NameID recibido por este SP estea cifrado.",
    "Indicates if the SP will validate all received XMLs." : "Indica se o SP validará todos os XML recibidos.",
    "ADFS URL-Encodes SAML data as lowercase, and the toolkit by default uses uppercase. Enable for ADFS compatibility on signature verification." : "ADFS URL-Cifra datos SAML en minúsculas, e o conxunto de ferramentas usa maiúsculas por omisión. Active ADFS para a compatibilidade na sinatura de verificación.",
    "Attribute to map the UID to." : "Atributo para asignar o UID.",
    "Only allow authentication if an account is existent on some other backend. (e.g. LDAP)" : "Permitir a autenticación só se a conta existe nalgunha outra infraestrutura. (p. ex. LDAP)",
    "Attribute to map the displayname to." : "Atributo para asignar o nome que amosar a",
    "Attribute to map the email address to." : "Atributo para asignar o enderezo de correo que amosar a",
    "Use SAML auth for the %s desktop clients (requires user re-authentication)" : "Usar a autenticación SAML para os clientes de escritorio %s (necesita unha re-autenticación do usuario)",
    "SSO & SAML authentication" : "Autenticación SSO e SAML",
    "Open documentation" : "Abrir a documentación",
    "Please choose whether you want to authenticate using the SAML provider built-in in Nextcloud or whether you want to authenticate against an environment variable." : "Escolla se quere autenticarse usando o provedor SAML integrado en Nextcloud ou se quere autenticarse nunha variábel de entorno.",
    "Use built-in SAML authentication" : "Usar a autenticación integrada de SAML",
    "Use environment variable" : "Usar variábel de entorno",
    "Make sure to configure an administrative user that can access the instance via SSO. Logging-in with your regular %s account won't be possible anymore." : "Asegúrese de configurar un usuario administrativo que poida acceder á instancia a través de SSO. Acceder coa sua conta normal %s xa non será posíbel.",
    "General" : "Xeral",
    "Service Provider Data" : "Provedor do servizo de datos",
    "If your Service Provider should use certificates you can optionally specify them here." : "Se o seu provedor do servizo usa certificados, pode, opcionalmente, especificalos aquí.",
    "Show Service Provider settings ..." : "Amosar os axustes do provedor do servizo ...",
    "Identity Provider Data" : "Identificación do provedor de datos",
    "Configure your IdP settings here." : "Configure os axustes do seu IdP aquí.",
    "Identifier of the IdP entity (must be a URI)" : "Identificador da entidade IdP (ten que ser un URI)",
    "URL Target of the IdP where the SP will send the Authentication Request Message" : "URL obxectivo do IdP onde o SP enviará a mensaxe de solicitude de autenticación",
    "Show optional Identity Provider settings ..." : "Amosar, opcionalmente, os axustes do provedor da identidade ...",
    "URL Location of the IdP where the SP will send the SLO Request" : "Enderezo URL do IdP onde o SP enviará as peticións SLO",
    "Public X.509 certificate of the IdP" : "Certificado público X.509 do IdP",
    "Attribute mapping" : "Asignación de atributos",
    "If you want to optionally map SAML attributes to the user you can configure these here." : "Se, opcionalmente, quere asignar atributos SAML ao usuario, pode configuralos aquí.",
    "Show attribute mapping settings ..." : "Amosar os axustes dos atributos asignados ...",
    "Security settings" : "Axustes de seguridade",
    "For increased security we recommend enabling the following settings if supported by your environment." : "Para incrementar a seguridade recomendámoslle que active os seguintes axustes se son admitidos polo seu entorno.",
    "Show security settings ..." : "Amosar os axustes de seguridade ...",
    "Signatures and encryption offered" : "Sinaturas e cifrado ofrecidos",
    "Signatures and encryption required" : "Sinaturas e cifrado requiridos",
    "Download metadata XML" : "Descargar metadatos en XML",
    "Metadata invalid" : "Metadatos incorrectos",
    "Metadata valid" : "Metadatos correctos",
    "Account not provisioned." : "Conta non aprovisionada.",
    "Your account is not provisioned, access to this service is thus not possible." : "A súa conta non esta aprovisionada, polo que non é posíbel o acceso a este servizo."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}