{ "translations": {
    "Saved" : "Disimpan",
    "Could not save" : "Tidak dapat menyimpan",
    "Provider" : "Penyedia",
    "This user account is disabled, please contact your administrator." : "Akun pengguna ini dinonaktifkan, silakan hubungi administrator Anda.",
    "Unknown error, please check the log file for more details." : "Kesalahan tidak diketahui, silakan periksa file log untuk rincian lebih lanjut.",
    "Direct log in" : "Login langsung",
    "SSO & SAML log in" : "Login SSO & SAML",
    "This page should not be visited directly." : "Halaman ini tidak boleh dikunjungi secara langsung.",
    "Provider %s" : "Penyedia %s",
    "X.509 certificate of the Service Provider" : "Sertifikat X.509 dari Penyedia Layanan",
    "Private key of the Service Provider" : "Kunci privat dari Penyedia Layanan",
    "Service Provider Entity ID (optional)" : "ID Entitas Penyedia Layanan (opsional)",
    "Indicates that the nameID of the <samlp:logoutRequest> sent by this SP will be encrypted." : "Menunjukkan bahwa nameID dari <samlp:logoutRequest> yang dikirim oleh SP ini akan dienkripsi.",
    "Indicates whether the <samlp:AuthnRequest> messages sent by this SP will be signed. [Metadata of the SP will offer this info]" : "Menunjukkan apakah pesan <samlp:AuthnRequest> yang dikirim oleh SP ini akan ditandatangani. [Metadata SP akan menawarkan info ini]",
    "Indicates whether the  <samlp:logoutRequest> messages sent by this SP will be signed." : "Menunjukkan apakah pesan <samlp:logoutRequest> yang dikirim oleh SP ini akan ditandatangani.",
    "Indicates whether the  <samlp:logoutResponse> messages sent by this SP will be signed." : "Menunjukkan apakah pesan <samlp:logoutResponse> yang dikirim oleh SP ini akan ditandatangani.",
    "Whether the metadata should be signed." : "Apakah metadata harus ditandatangani.",
    "Indicates a requirement for the <samlp:Response>, <samlp:LogoutRequest> and <samlp:LogoutResponse> elements received by this SP to be signed." : "Menunjukkan persyaratan agar elemen <samlp:Response>, <samlp:LogoutRequest>, dan <samlp:LogoutResponse> yang diterima oleh SP ini harus ditandatangani.",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be signed. [Metadata of the SP will offer this info]" : "Menunjukkan persyaratan agar elemen <saml:Assertion> yang diterima oleh SP ini harus ditandatangani. [Metadata SP akan menawarkan info ini]",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be encrypted." : "Menunjukkan persyaratan agar elemen <saml:Assertion> yang diterima oleh SP ini harus dienkripsi.",
    " Indicates a requirement for the NameID element on the SAMLResponse received by this SP to be present." : "Menunjukkan persyaratan agar elemen NameID pada SAMLResponse yang diterima oleh SP ini harus ada.",
    "Indicates a requirement for the NameID received by this SP to be encrypted." : "Menunjukkan persyaratan agar NameID yang diterima oleh SP ini harus dienkripsi.",
    "Indicates if the SP will validate all received XML." : "Menunjukkan apakah SP akan memvalidasi semua XML yang diterima.",
    "ADFS URL-Encodes SAML data as lowercase, and the toolkit by default uses uppercase. Enable for ADFS compatibility on signature verification." : "ADFS melakukan URL-encode data SAML sebagai huruf kecil, dan toolkit secara default menggunakan huruf besar. Aktifkan untuk kompatibilitas ADFS pada verifikasi tanda tangan.",
    "Algorithm that the toolkit will use on signing process." : "Algoritma yang akan digunakan toolkit dalam proses penandatanganan.",
    "Retrieve query parameters from $_SERVER. Some SAML servers require this on SLO requests." : "Ambil parameter kueri dari $_SERVER. Beberapa server SAML memerlukan ini pada permintaan SLO.",
    "Attribute to map the UID to." : "Atribut untuk memetakan UID.",
    "Only allow authentication if an account exists on some other backend (e.g. LDAP)." : "Hanya izinkan autentikasi jika akun ada pada backend lain (mis. LDAP).",
    "Attribute to map the displayname to." : "Atribut untuk memetakan nama tampilan.",
    "Attribute to map the email address to." : "Atribut untuk memetakan alamat email.",
    "Attribute to map the quota to." : "Atribut untuk memetakan kuota.",
    "Attribute to map the users home to." : "Atribut untuk memetakan home pengguna.",
    "Attribute to map the users groups to." : "Atribut untuk memetakan grup pengguna.",
    "Attribute to map the users MFA login status" : "Atribut untuk memetakan status login MFA pengguna",
    "Group Mapping Prefix, default: %s" : "Prefiks Pemetaan Grup, default: %s",
    "Reject members of these groups. This setting has precedence over required memberships." : "Tolak anggota dari grup-grup ini. Pengaturan ini memiliki prioritas di atas keanggotaan yang diwajibkan.",
    "Group A, Group B, …" : "Grup A, Grup B, …",
    "Require membership in these groups, if any." : "Wajibkan keanggotaan dalam grup-grup ini, jika ada.",
    "Email address" : "Alamat email",
    "Encrypted" : "Terenkripsi",
    "Entity" : "Entitas",
    "Kerberos" : "Kerberos",
    "Persistent" : "Persisten",
    "Transient" : "Sementara",
    "Unspecified" : "Tidak ditentukan",
    "Windows domain qualified name" : "Nama yang memenuhi kualifikasi domain Windows",
    "X509 subject name" : "Nama subjek X509",
    "Optional display name of the identity provider (default: \"SSO & SAML log in\")" : "Nama tampilan opsional untuk penyedia identitas (default: \"Login SSO & SAML\")",
    "Use POST method for SAML request (default: GET)" : "Gunakan metode POST untuk permintaan SAML (default: GET)",
    "Allow the use of multiple user back-ends (e.g. LDAP)" : "Izinkan penggunaan beberapa backend pengguna (mis. LDAP)",
    "SSO & SAML authentication" : "Autentikasi SSO & SAML",
    "Authenticate using single sign-on" : "Autentikasi menggunakan single sign-on",
    "Using the SSO & SAML app of your Nextcloud you can make it easily possible to integrate your existing Single-Sign-On solution with Nextcloud. In addition, you can use the Nextcloud LDAP user provider to keep the convenience for users. (e.g. when sharing)\nThe following providers are supported and tested at the moment:\n\n* **SAML 2.0**\n\t* OneLogin\n\t* Shibboleth\n\t* Active Directory Federation Services (ADFS)\n\n* **Authentication via Environment Variable**\n\t* Kerberos (mod_auth_kerb)\n\t* Any other provider that authenticates using the environment variable\n\nWhile theoretically any other authentication provider implementing either one of those standards is compatible, we like to note that they are not part of any internal test matrix." : "Dengan menggunakan aplikasi SSO & SAML pada Nextcloud, Anda dapat dengan mudah mengintegrasikan solusi Single-Sign-On yang sudah ada dengan Nextcloud. Selain itu, Anda dapat menggunakan penyedia pengguna Nextcloud LDAP untuk tetap memberikan kemudahan bagi pengguna (mis. saat berbagi)\nPenyedia berikut didukung dan diuji saat ini:\n\n* **SAML 2.0**\n\t* OneLogin\n\t* Shibboleth\n\t* Active Directory Federation Services (ADFS)\n\n* **Autentikasi melalui Variabel Lingkungan**\n\t* Kerberos (mod_auth_kerb)\n\t* Penyedia lain apa pun yang mengautentikasi menggunakan variabel lingkungan\n\nMeskipun secara teori penyedia autentikasi lain yang mengimplementasikan salah satu standar tersebut kompatibel, kami ingin mencatat bahwa mereka bukan bagian dari matriks pengujian internal kami.",
    "Open documentation" : "Buka dokumentasi",
    "Make sure to configure an administrative user that can access the instance via SSO. Logging-in with your regular %s account will not be possible anymore, unless you enabled \"%s\" or you go directly to the URL %s." : "Pastikan untuk mengonfigurasi pengguna administrator yang dapat mengakses instans melalui SSO. Login dengan akun %s reguler Anda tidak akan dapat dilakukan lagi, kecuali Anda mengaktifkan \"%s\" atau Anda masuk langsung ke URL %s.",
    "Make sure to configure an administrative user that can access the instance via SSO. Logging-in with your regular %s account will not be possible anymore, unless you go directly to the URL %s." : "Pastikan untuk mengonfigurasi pengguna administrator yang dapat mengakses instans melalui SSO. Login dengan akun %s reguler Anda tidak akan dapat dilakukan lagi, kecuali Anda masuk langsung ke URL %s.",
    "Please choose whether you want to authenticate using the SAML provider built-in in Nextcloud or whether you want to authenticate against an environment variable." : "Silakan pilih apakah Anda ingin mengautentikasi menggunakan penyedia SAML bawaan di Nextcloud atau apakah Anda ingin mengautentikasi terhadap variabel lingkungan.",
    "Use built-in SAML authentication" : "Gunakan autentikasi SAML bawaan",
    "Use environment variable" : "Gunakan variabel lingkungan",
    "Global settings" : "Pengaturan global",
    "Remove identity provider" : "Hapus penyedia identitas",
    "Add identity provider" : "Tambah penyedia identitas",
    "General" : "Umum",
    "This feature might not work with all identity providers. Use only if your IdP specifically requires POST binding for SAML requests." : "Fitur ini mungkin tidak berfungsi dengan semua penyedia identitas. Gunakan hanya jika IdP Anda secara khusus memerlukan binding POST untuk permintaan SAML.",
    "Service Provider Data" : "Data Penyedia Layanan",
    "If your Service Provider should use certificates you can optionally specify them here." : "Jika Penyedia Layanan Anda harus menggunakan sertifikat, Anda dapat menentukan sertifikat tersebut secara opsional di sini.",
    "Show Service Provider settings…" : "Tampilkan pengaturan Penyedia Layanan…",
    "Name ID format" : "Format Name ID",
    "Identity Provider Data" : "Data Penyedia Identitas",
    "Identifier of the IdP entity (must be a URI)" : "Pengenal entitas IdP (harus berupa URI)",
    "URL Target of the IdP where the SP will send the Authentication Request Message" : "URL target IdP tempat SP akan mengirim Pesan Permintaan Autentikasi",
    "Show optional Identity Provider settings…" : "Tampilkan pengaturan Penyedia Identitas opsional…",
    "URL Location of the IdP where the SP will send the SLO Request" : "URL lokasi IdP tempat SP akan mengirim Permintaan SLO",
    "URL Location of the IDP's SLO Response" : "URL lokasi Respons SLO IdP",
    "Public X.509 certificate of the IdP" : "Sertifikat X.509 publik dari IdP",
    "Request parameters to pass-through to IdP (comma separated list)" : "Parameter permintaan untuk diteruskan ke IdP (daftar dipisahkan koma)",
    "Attribute mapping" : "Pemetaan atribut",
    "If you want to optionally map attributes to the user you can configure these here." : "Jika Anda ingin memetakan atribut secara opsional ke pengguna, Anda dapat mengonfigurasinya di sini.",
    "Show attribute mapping settings…" : "Tampilkan pengaturan pemetaan atribut…",
    "Security settings" : "Pengaturan keamanan",
    "For increased security we recommend enabling the following settings if supported by your environment." : "Untuk keamanan yang lebih tinggi, kami menyarankan mengaktifkan pengaturan berikut jika didukung oleh lingkungan Anda.",
    "Show security settings…" : "Tampilkan pengaturan keamanan…",
    "Signatures and encryption offered" : "Tanda tangan dan enkripsi yang ditawarkan",
    "Signatures and encryption required" : "Tanda tangan dan enkripsi diwajibkan",
    "User filtering" : "Penyaringan pengguna",
    "If you want to optionally restrict user login depending on user data, configure it here." : "Jika Anda ingin membatasi login pengguna secara opsional bergantung pada data pengguna, konfigurasikan di sini.",
    "Show user filtering settings …" : "Tampilkan pengaturan penyaringan pengguna …",
    "Download metadata XML" : "Unduh metadata XML",
    "Reset settings" : "Setel ulang pengaturan",
    "Metadata invalid" : "Metadata tidak valid",
    "Metadata valid" : "Metadata valid",
    "Error" : "Kesalahan",
    "Please wait while you are redirected to the SSO server." : "Silakan tunggu sementara Anda dialihkan ke server SSO.",
    "JavaScript is disabled in your browser. Please enable it to continue." : "JavaScript dinonaktifkan di peramban Anda. Silakan aktifkan untuk melanjutkan.",
    "Access denied." : "Akses ditolak.",
    "Your account is denied, access to this service is thus not possible." : "Akun Anda ditolak, sehingga akses ke layanan ini tidak dimungkinkan.",
    "Account not provisioned." : "Akun tidak diprovisikan.",
    "Your account is not provisioned, access to this service is thus not possible." : "Akun Anda tidak diprovisikan, sehingga akses ke layanan ini tidak dimungkinkan.",
    "Login options:" : "Opsi login:",
    "Choose an authentication provider" : "Pilih penyedia autentikasi",
    "Group Mapping Prefix, default: SAML_" : "Prefiks Pemetaan Grup, default: SAML_"
},"pluralForm" :"nplurals=1; plural=0;"
}