{ "translations": {
    "Saved" : "Збережено",
    "Could not save" : "Не вдалося зберегти",
    "Provider" : "Провайдер",
    "This user account is disabled, please contact your administrator." : "Обліковий запис не активний, будь ласка зверніться до адміністратора.",
    "Unknown error, please check the log file for more details." : "Невідома помилка, будь ласка, перевірте файл журналу, щоб дізнатися більше.",
    "Direct log in" : "Прямий вхід",
    "SSO & SAML log in" : "Увійдіть у систему SSO та SAML",
    "This page should not be visited directly." : "Цю сторінку не слід відвідувати безпосередньо.",
    "X.509 certificate of the Service Provider" : "Сертифікат X.509 Постачальника послуг",
    "Private key of the Service Provider" : "Закритий ключ Постачальника послуг",
    "Service Provider Entity ID (optional)" : "Ідентифікатор організації постачальника послуг (необов'язково)",
    "Indicates that the nameID of the <samlp:logoutRequest> sent by this SP will be encrypted." : "Вказує, що nameID, надісланий цим <samlp:logoutRequest> SP, буде зашифровано.",
    "Indicates whether the <samlp:AuthnRequest> messages sent by this SP will be signed. [Metadata of the SP will offer this info]" : "Вказує, чи будуть підписані <samlp:AuthnRequest> повідомлення, надіслані цим SP. [Метадані SP нададуть цю інформацію]",
    "Indicates whether the  <samlp:logoutRequest> messages sent by this SP will be signed." : "Вказує, чи будуть <samlp:logoutRequest> підписані повідомлення, надіслані цим SP.",
    "Indicates whether the  <samlp:logoutResponse> messages sent by this SP will be signed." : "Вказує, чи будуть підписані <samlp:logoutResponse> повідомлення, надіслані цим SP.",
    "Whether the metadata should be signed." : "Чи мають бути підписані метадані.",
    "Indicates a requirement for the <samlp:Response>, <samlp:LogoutRequest> and <samlp:LogoutResponse> elements received by this SP to be signed." : "Вказує на вимогу для підпису елементів <samlp:Response>, <samlp:LogoutRequest> і <samlp:LogoutResponse>, отриманих цим SP.",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be signed. [Metadata of the SP will offer this info]" : "Вказує на вимогу, щоб <saml:Assertion> елементи, отримані цим SP, було підписано. [Метадані SP нададуть цю інформацію]",
    "Indicates a requirement for the <saml:Assertion> elements received by this SP to be encrypted." : "Вказує на вимогу, щоб елементи, отримані цим <saml:Assertion> SP, було зашифровано.",
    " Indicates a requirement for the NameID element on the SAMLResponse received by this SP to be present." : "Вказує на вимогу до елемента NameID у SAMLResponse, отриманому цим SP.",
    "Indicates a requirement for the NameID received by this SP to be encrypted." : "Вказує на вимогу шифрування NameID, який було отримано цим SP.",
    "Indicates if the SP will validate all received XML." : "Вказує, чи буде SP перевіряти всі отримані XML.",
    "ADFS URL-Encodes SAML data as lowercase, and the toolkit by default uses uppercase. Enable for ADFS compatibility on signature verification." : "ADFS URL-кодує дані SAML у нижньому регістрі, а інструментарій за замовчуванням використовує верхній регістр. Увімкніть для сумісності з ADFS при перевірці підпису.",
    "Algorithm that the toolkit will use on signing process." : "Алгоритм, який інструментарій використовуватиме під час підписання.",
    "Retrieve query parameters from $_SERVER. Some SAML servers require this on SLO requests." : "Отримати параметри запиту з $_SERVER. Деякі SAML-сервери вимагають цього для SLO-запитів.",
    "Attribute to map the UID to." : "Атрибут для зіставлення UID.",
    "Only allow authentication if an account exists on some other backend (e.g. LDAP)." : "Дозволяти автентифікацію тільки якщо обліковий запис існує на іншому бекенді (наприклад, LDAP).",
    "Attribute to map the displayname to." : "Атрибут для зіставлення назви дисплея.",
    "Attribute to map the email address to." : "Атрибут для прив'язки адреси електронної пошти.",
    "Attribute to map the quota to." : "Атрибут, на який потрібно зіставити квоту.",
    "Attribute to map the users home to." : "Атрибут для відображення місця проживання користувачів.",
    "Attribute to map the users groups to." : "Атрибут для зіставлення груп користувачів.",
    "Attribute to map the users MFA login status" : "Атрибут для відображення статусу входу користувача в MFA",
    "Group Mapping Prefix, default: %s" : "Префікс групового зіставлення, за замовчуванням: %s",
    "Reject members of these groups. This setting has precedence over required memberships." : "Відхилити членів цих груп. Цей параметр має пріоритет над обов'язковим членством.",
    "Group A, Group B, …" : "Група А, група Б, ...",
    "Require membership in these groups, if any." : "Вимагайте членства в цих групах, якщо такі є.",
    "Email address" : "Адреса ел.пошти",
    "Encrypted" : "Зашифровано",
    "Entity" : "Сутність",
    "Kerberos" : "Керберос",
    "Persistent" : "Наполегливий",
    "Transient" : "Перехідний",
    "Unspecified" : "Невизначений",
    "Windows domain qualified name" : "Кваліфіковане доменне ім'я Windows",
    "X509 subject name" : "X509 Назва теми",
    "Optional display name of the identity provider (default: \"SSO & SAML log in\")" : "Необов'язкове ім'я постачальника ідентифікаційних даних (за замовчуванням: \"SSO &amp; SAML log in\")",
    "Use POST method for SAML request (default: GET)" : "Використовуйте метод POST для SAML-запиту (за замовчуванням: GET)",
    "Allow the use of multiple user back-ends (e.g. LDAP)" : "Дозволяє використовувати декілька користувацьких серверів (наприклад, LDAP)",
    "SSO & SAML authentication" : "Авторизація за допомогою SSA та SAML",
    "Authenticate using single sign-on" : "Автентифікація за допомогою єдиного входу",
    "Using the SSO & SAML app of your Nextcloud you can make it easily possible to integrate your existing Single-Sign-On solution with Nextcloud. In addition, you can use the Nextcloud LDAP user provider to keep the convenience for users. (e.g. when sharing)\nThe following providers are supported and tested at the moment:\n\n* **SAML 2.0**\n\t* OneLogin\n\t* Shibboleth\n\t* Active Directory Federation Services (ADFS)\n\n* **Authentication via Environment Variable**\n\t* Kerberos (mod_auth_kerb)\n\t* Any other provider that authenticates using the environment variable\n\nWhile theoretically any other authentication provider implementing either one of those standards is compatible, we like to note that they are not part of any internal test matrix." : "За допомогою програми SSO & SAML вашого Nextcloud ви можете легко інтегрувати існуюче рішення Single-Sign-On з Nextcloud. Крім того, ви можете використовувати LDAP-провайдер Nextcloud, щоб зберегти зручність для користувачів (наприклад, при обміні файлами).\nНа даний момент підтримуються і протестовані наступні провайдери:\n\n* **SAML 2.0**\n* OneLogin\n* Shibboleth\n* Active Directory Federation Services (ADFS)\n\n* **Аутентифікація через змінну середовища**\n* Kerberos (mod_auth_kerb)\n* Будь-який інший провайдер, який здійснює аутентифікацію за допомогою змінної середовища\n\nХоча теоретично будь-який інший провайдер аутентифікації, що реалізує будь-який з цих стандартів, є сумісним, ми хотіли б зазначити, що вони не входять до жодної внутрішньої матриці тестування.",
    "Open documentation" : "Відкрити документацію",
    "Make sure to configure an administrative user that can access the instance via SSO. Logging-in with your regular %s account will not be possible anymore, unless you enabled \"%s\" or you go directly to the URL %s." : "Обов’язково налаштуйте адміністратора сервера, який буде мати доступ до цього примірника за допомогою системи єдиного входу (SSO). Вхід за допомогою звичайного облікового запису %s більше не буде можливим, якщо ви не увімкнете \"%s\" або не перейдете безпосередньо за посиланням %s.",
    "Make sure to configure an administrative user that can access the instance via SSO. Logging-in with your regular %s account will not be possible anymore, unless you go directly to the URL %s." : "Обов’язково налаштуйте адміністратора сервера, який буде мати доступ до цього примірника за допомогою системи єдиного входу (SSO). Вхід за допомогою звичайного облікового запису %s більше не буде можливим, якщо ви не перейдете безпосередньо за посиланням %s.",
    "Please choose whether you want to authenticate using the SAML provider built-in in Nextcloud or whether you want to authenticate against an environment variable." : "Виберіть, чи хочете ви автентифікуватися за допомогою вбудованого в Nextcloud постачальника SAML, чи за допомогою змінної оточення.",
    "Use built-in SAML authentication" : "Використовувати вбудовану авторизацію SAML",
    "Use environment variable" : "Використовуйте змінну оточення",
    "Global settings" : "Глобальні налаштування",
    "Remove identity provider" : "Видалити постачальника ідентифікаційних даних",
    "Add identity provider" : "Додати постачальника ідентифікаційних даних",
    "General" : "Загальна",
    "This feature might not work with all identity providers. Use only if your IdP specifically requires POST binding for SAML requests." : "Ця функція може працювати не з усіма постачальниками ідентичностей. Використовуйте тільки якщо ваш постачальник ідентифікаційних даних вимагає прив'язки POST для SAML-запитів.",
    "Service Provider Data" : "Дані постачальника послуг",
    "If your Service Provider should use certificates you can optionally specify them here." : "Якщо ваш постачальник послуг має використовувати сертифікати, ви можете додатково вказати їх тут.",
    "Show Service Provider settings…" : "Показати налаштування постачальника послуг…",
    "Name ID format" : "Формат ідентифікатора імені",
    "Identity Provider Data" : "Дані провайдера ідентифікаційної інформації",
    "Identifier of the IdP entity (must be a URI)" : "Ідентифікатор об’єкта IdP (має бути URI)",
    "URL Target of the IdP where the SP will send the Authentication Request Message" : "Цільова URL-адреса IdP, куди SP надсилатиме запити на авторизацію",
    "Show optional Identity Provider settings…" : "Показати необов'язкові налаштування постачальника ідентифікаційних даних...",
    "URL Location of the IdP where the SP will send the SLO Request" : "URL-адреса Розташування IdP, куди SP надішле запит SLO",
    "URL Location of the IDP's SLO Response" : "URL-адреса відповіді ВПО на запит про виконання ОПП",
    "Public X.509 certificate of the IdP" : "Публічний сертифікат X.509 IdP",
    "Request parameters to pass-through to IdP (comma separated list)" : "Запит параметрів для передачі до IdP (список через кому)",
    "Attribute mapping" : "Мапування атрибутів",
    "If you want to optionally map attributes to the user you can configure these here." : "Якщо ви хочете додатково зіставити атрибути з користувачем, ви можете налаштувати їх тут.",
    "Show attribute mapping settings…" : "Показати налаштування відображення атрибутів...",
    "Security settings" : "Налаштування безпеки",
    "For increased security we recommend enabling the following settings if supported by your environment." : "Для підвищення безпеки ми рекомендуємо ввімкнути такі параметри, якщо вони підтримуються вашим середовищем.",
    "Show security settings…" : "Показати налаштування безпеки...",
    "Signatures and encryption offered" : "Пропонуються підписи та шифрування",
    "Signatures and encryption required" : "Потрібні підписи та шифрування",
    "User filtering" : "Фільтрація користувачів",
    "If you want to optionally restrict user login depending on user data, configure it here." : "Якщо ви хочете додатково обмежити вхід в систему залежно від даних користувача, налаштуйте це тут.",
    "Show user filtering settings …" : "Показати налаштування фільтрації користувачів ...",
    "Download metadata XML" : "Звантажити метадані XML",
    "Reset settings" : "Скинути налаштування",
    "Metadata invalid" : "Недійсні метадані",
    "Metadata valid" : "Метадані дійсні",
    "Error" : "Помилка",
    "Please wait while you are redirected to the SSO server." : "Зачекайте, будь ласка, поки вас перенаправлять на сервер SSO.",
    "JavaScript is disabled in your browser. Please enable it to continue." : "У вашому браузері вимкнено JavaScript. Будь ласка, увімкніть його, щоб продовжити.",
    "Access denied." : "Доступ заборонено.",
    "Your account is denied, access to this service is thus not possible." : "Ваш обліковий запис заблоковано, тому доступ до цієї послуги неможливий.",
    "Account not provisioned." : "Обліковий запис не надано.",
    "Your account is not provisioned, access to this service is thus not possible." : "Ваш обліковий запис не надано, тому доступ до цієї послуги неможливий.",
    "Login options:" : "Параметри входу:",
    "Choose an authentication provider" : "Виберіть постачальника послуг автентифікації",
    "Group Mapping Prefix, default: SAML_" : "Префікс групового відображення, за замовчуванням: SAML_"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);"
}